export const configObj = {
    'object': {
        "Детский садик 'вишенка'":{
            devices: [
                {
                    ip: "192.168.1.12",
                    names: ["Коридор", "Фойе"]
                },
                {
                    ip: "192.168.1.13",
                    names: ["Кухня", "Варня"]
                },
                {
                    ip: "192.168.1.15",
                    names: ["Игровая площадка"]
                }
        ],
        color: '#ff0000'
        },
        "Крематорий 'барбекью'":{
            devices: [
                {
                    ip: "192.168.1.20",
                    names: ["Печи"]
                },
                {
                    ip: "192.168.1.21",
                    names: ["Морозильник", "Холодильник"]
                },
                {
                    ip: "192.168.1.22",
                    names: ["Вещевая"]
                }
        ],
        color: '#00ff00'
        },
        "Администрация":{
            devices: [
                {
                    ip: "192.168.1.29",
                    names: ["Парадный вход"]
                },
                {
                    ip: "192.168.1.30",
                    names: ["Бухгалтерия", "Считоводня"]
                },
                {
                    ip: "192.168.1.32",
                    names: ["Столовая"]
                }
            ],
            color: '#000055'
        }
},
    'event': [
        "Зарегистрирован проход.",
        "Доступ запрещен. Отсутствует разрешение на проход.",
        "Зарегистрирован проход, санкционированный с кнопки.",
        "Доступ запрещен."
        ],
    'route': [
        "Вход",
        "Выход"
        ],
    'person': [
        "-",
        "Артем Артишев",
        "Николай Таратьев",
        "Ксения Воробьева",
        "Михаил Коленьев",
        "Ринат Благовещенский",
        "Виталий Трубной",
        "Виталий Мерзляков",
        "Юрий Удинский",
        "Эльдар Голубикин",
        "Олег Симонов",
        "Сергей Голенский",
        "Наталья Морозова",
        "Матвей Шестаковский",
        ],
        'pass_number': [
            "-",
            "121.15547",
            "242.31844",
            "301.31412",
            "024.72154",
            "047.20140",
            "123.25200",
            "120.44417",
            "401.40400",
            "024.12109",
            "021.31544",
            "004.10240",
            "210.21406",
            "109.31001",
        ],
        translate: {
            'object': 'Объекты',
            'event': 'События',
            'route': 'Направление',
            'person': 'Владелец',
            'pass_number': 'Номер владельца' 
        }
}
    


// export const configObj = {
//     Объекты: {"Детский садик 'вишенка'":{
//         Точки: [
//         "Коридор",
//         "Кухня",
//         "Игровая площадка"
//         ],
//         'ip устройств':  [
//             "192.168.1.12",
//             "192.168.1.13",
//             "192.168.1.15"
//             ]
//     },
//     "Крематорий 'барбекью'":{
//         Точки: [
//             "Печи",
//             "Морозильник",
//             "Вещевая"
//         ],
//         'ip устройств':  [
//             "192.168.1.20",
//             "192.168.1.21",
//             "192.168.1.22"
//             ]
//     },
//     "Администрация":{
//         Точки: [
//             "Парадный вход",
//             "Бухгалтерия",
//             "Столовая"
//         ],
//         'ip устройств':  [
//             "192.168.1.29",
//             "192.168.1.30",
//             "192.168.1.32"
//             ]
//     }
// },
//     'События': [
//         "Зарегистрирован проход.",
//         "Доступ запрещен. Отсутствует разрешение на проход.",
//         "Зарегистрирован проход, санкционированный с кнопки.",
//         "Доступ запрещен."
//         ],
//     Направление: [
//         "Вход",
//         "Выход"
//         ],
//     Владелец: [
//         "-",
//         "Артем Артишев",
//         "Николай Таратьев",
//         "Ксения Воробьева",
//         "Михаил Коленьев",
//         "Ринат Благовещенский",
//         "Виталий Трубной",
//         "Виталий Мерзляков",
//         "Юрий Удинский",
//         "Эльдар Голубикин",
//         "Олег Симонов",
//         "Сергей Голенский",
//         "Наталья Морозова",
//         "Матвей Шестаковский",
//         ],
//         'Номер владельца': [
//             "-",
//             "121.15547",
//             "242.31844",
//             "301.31412",
//             "024.72154",
//             "047.20140",
//             "123.25200",
//             "120.44417",
//             "401.40400",
//             "024.12109",
//             "021.31544",
//             "004.10240",
//             "210.21406",
//             "109.31001",
//         ]
// }

// export const configObj = {
//     Объекты: ["Детский садик 'вишенка'",
//     "Крематорий 'барбекью'",
//     "Администрация"],
//     devname: [
//             [
//             "Коридор",
//             "Кухня",
//             "Игровая площадка"
//             ],
//             [
//             "Печи",
//             "Морозильник",
//             "Вещевая"
//             ],
//             [
//             "Парадный вход",
//             "Бухгалтерия",
//             "Столовая"
//             ]
//         ],
//     devip: [
//         [
//         "192.168.1.12",
//         "192.168.1.13",
//         "192.168.1.15"
//         ],
//         [
//         "192.168.1.20",
//         "192.168.1.21",
//         "192.168.1.22"
//         ],
//         [
//         "192.168.1.29",
//         "192.168.1.30",
//         "192.168.1.32"
//         ]
//     ],
//     event: [
//         "Зарегистрирован проход.",
//         "Доступ запрещен. Отсутствует разрешение на проход.",
//         "Зарегистрирован проход, санкционированный с кнопки.",
//         "Доступ запрещен."
//         ],
//     route: [
//         "Вход",
//         "Выход"
//         ],
//     person: [
//         "-",
//         "Артем Артишев",
//         "Николай Таратьев",
//         "Ксения Воробьева",
//         "Михаил Коленьев",
//         "Ринат Благовещенский",
//         "Виталий Трубной",
//         "Виталий Мерзляков",
//         "Юрий Удинский",
//         "Эльдар Голубикин",
//         "Олег Симонов",
//         "Сергей Голенский",
//         "Наталья Морозова",
//         "Матвей Шестаковский",
//         ],
//         person_number: [
//             "-",
//             "121.15547",
//             "242.31844",
//             "301.31412",
//             "024.72154",
//             "047.20140",
//             "123.25200",
//             "120.44417",
//             "401.40400",
//             "024.12109",
//             "021.31544",
//             "004.10240",
//             "210.21406",
//             "109.31001",
//         ]
// }
    
  
  